/* _____________ 숫자 다루기 _____________ */

/*
  ***** 적용 *****
- 자바스크립트에서 수를 계산하고 싶을 때

* 숫자는 자바스크립트의 기본 데이터 타입 중의 하나로 정수와 소수를 사용하며, 타입은 Number.


  ***** Syntax *****
    작업 : 예
    수학 계산 : 10의 2승 계산하기
    어림 계산 : 세금을 포함한 금액을 정수로 산출
    삼각 함수 다루기 : 애니메이션의 궤적 구하기
    임의의 수 다루기 : 애니메이션에 임의 값(움직임) 부여하기

    * 10진수 외에도 16진수, 8진수, 2진수의 표현이 가능함.
    표기 예 : 의미
    10,240,12400,3.14 : 10진수
    0xFF0000, 0xCCCCCC : 16진수
    0o123,0o7777 : 8진수
    0b111,0b0101010 2진수
  
- 수학적으로 수의 크기 자체는 무한대까지 정의가 가능하지만, 자바스크립트에서는 수의 표현이 제한됨.

정수 : 의미 : 값
Number.MAX_VALUE : 최대 정숫갑 : 1.7976931348623157e+308
Number.MIN.VALUE : 최소 정숫값 : 5e-324
Number.MAX_SAFE_INTEGER : 다룰 수 있는 최대 정숫값 : 90071992540991
Number.MIN_SAFE_INTEGER : 다룰 수 있는 최소 정숫값 : -90071992540991
 */
